testCaseSphereSmoothing/noSlip/sphereSmaller/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

PorousMedia.stl
{
    // Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       100;

curvature true;
    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;

// Output options:

    // Write features to obj format for postprocessing
    writeObj            no;
}

// ************************************************************************* //
